# 怎样的思路才算成熟？

作者：caoglish
链接：https://www.zhihu.com/question/35280979/answer/62296679


思路本身是没有成熟不成熟的。在你看来成熟的思路，可能在别人眼里就不成熟。怎么思考都没有问题,怎么思考都是成熟的,怎么思考都是不成熟的，当然，这不是我们要追求的答案。

下面我来说说我的看法

### 1.如何接受自己决断后的结果
其实，成熟与否不在思路本身，而是**如何看待根据你思路去执行产生的结果**。

"如何看待根据你思路去执行而产生的结果"的思考，是有成熟和不成熟之分的。

一般来说:
* 不成熟: 迷惑不知道对错;做过以后会后悔.
* 成熟: 坚定不移的认为是做对的,绝不后悔,如果发生不好的结果，接受这个结果

我们做事一般流程: **思路 -> 决断 ->执行 -> 结果**

- 思路产生多种方案，并预测结果（包括了失败的风险）
- 决断是在多种方案中选出自己认为最合适的方案去执行，其中有一项就是认为这个方案的结果是可以接受的（包括失败后最坏的结果）
- 执行是去做选择出来的那个方案
- 结果是执行后一定几率成功，一定几率失败。

其中最最困难的一项就是决断，因为做决断后，表明了你愿意接受最坏的结果。真的发生最坏的情况后，你必须要坚定的表示这个决断还是对的，而且不能后悔。

犹豫不决；当断不断，反受其乱；多谋少决 等等成语，都是来形容不善于做决断的人。不善于做决断的人，都是不知道如何选择方案，接受方案结果。而这样就是**不成熟**。

相反，如果当机立断，就算是选择的方案非常不好，结果也非常坏，但是最后还是能接受，那么就是**成熟**的。

### 2. 思路的几种情况
我想出几种方案思路的情况
1. 提出的方案能照顾的方方面面的人的利益
2. 几种方案结果都是比较糟糕的，两全相害取其轻
3. 几种方案结果都是非常糟糕的，每个方案的结果都难以接受
4. 方案的利益和风险成正比

第一种情况是一般所有人都可以接受的，一般也被认为非常厉害的方案，也通常认为是成熟方案，这更可能是题主说要追求的思维方式。然而现实是，这样的方式可遇而不可求，遇见的机会和场合不太多。然后如果真的遇上了，能提出这样的方案，结果虽然是皆大欢喜，但是这只是维持了每个利益团体的最基本利益，但是谁得到了最大的发展，很难说。

第二种情况，就是你必须在一堆结果都不好的方案中，做出一个选择，并接受它，因为做出一个选择，比不做结果要好。这个决断好做些，因为两全相害取其轻。

第三种情况，还是你必须在一堆结果都不好的方案中，做出一个选择，并接受它，但是其结果都相当糟糕，你就必须做一个决断，选其中一个做到底，并且接受这个最糟糕的结果。

第四种情况，就是测试你的冒险偏好了，你愿意低风险低收益还是高风险高收益的方案，就是看你个人能力和你的风险偏好了。这个是最好测试你的思考方式是否成熟的一种情况了，只要你选择了，不后悔，能接受你所有选择的最坏情况。那么你的思考方式就是成熟的。（当然，选择高风险后失败了，就非常后悔，那么就是不成熟）

其实无论上述4种情况下的各种方案，都有它们的优势和它们的劣势，关键是你要在权衡再三后做出一个决断，然后义无反顾不后悔的去执行它，无论什么结果，都不后悔的去接受它，这就是我想说的成熟思路了。

综上所述，成熟的思路应该是：
无论如何必须做出一个决断，使用众多方案中的一个方案
做出决断后，不能后悔自己这个决断
做出决断后，就算执行后却得到一个非常难以接受的最坏的结果，但是自己还是接受了
作出决断后，明明知道会带来不好的影响或者是结果，也会义无反顾的做到底。

### 3. 最后分析一下题主的思路
从我以上的概念来分析题主的思路，那么题主的思路是不成熟的。原因很简单：
1）做出了选择之后后悔。
2）无法坚定的对一个选择一路走到底
3）想到了方方面面，却又无法做决断

第一个机车吧，你说的每个方案都有它的好处，也都有它的坏处，你又想不到一个能包含所有优点的方案。那么成熟的做法应该是选择其中一条，不后悔的走到黑。

然而你选择了踏板车后，后悔；如果选机车，又怕警察抓。犹犹豫豫不下决断，就是不成熟的思路表现


买车同样，买了手动，觉得开车累；买自动，又觉得没有买手动乐趣；两个都买，可能觉得自己没有这个财力。然后又陷入了无尽地决断当中了。

然而你无论选择哪种方案，最后都是要后悔的。所以你还是无法选择。

你这样的情况，用一个成语来说就是：多谋少决
解释一下就是：想得太多，决断太少。

然而你又是完美主义者，什么都是想要最好的，什么功能都是要有的才好。却又不知道如何去做。那么用一个成语就是：好高骛远

是病，得治。


### 4. 处方
1）减少需求。题主需求太多了，必须减少，可以把主要需求减少到3个。只要有方案符合这3个需求，立刻做决断，执行这个方案
2）少想多做，先做再想。只要不是非常重要的决断，如果几个方案都可以的话，就先选一个先做起来，做一段时间进行评估，然后再做进一步的最后决断使用那个作为长期方案
3）思考最坏结果，接受最坏结果。老是怕这个，怕那个的，觉得这个结果不好，那个结果不好，那么什么决断都做不了了。
4）做好决断，不要后悔。仔细想好，做好决断，一路走到黑，不要后悔修改
